{"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [900, 390], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "fc1", "class_name": "Dense", "config": {"name": "fc1", "trainable": true, "units": 200, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "embeddings", "class_name": "Lambda", "config": {"name": "embeddings", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AFMAKQFOqQApAdoBeXIBAAAAcgEAAAD6aS9Vc2Vy\ncy9qL2RlZXAtc3BlYWtlci1kYXRhL3ZlbnYtc3BlYWtlci9hbWVuZGV6cC1jczIzMC13aW50ZXIt\nMjAxOC9maW5hbF9wcm9qZWN0L3NjcmlwdHMvbW9kZWxfYnVpbGRlci5wedoIPGxhbWJkYT7sAQAA\ncwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"name": "softmax", "class_name": "Dense", "config": {"name": "softmax", "trainable": true, "units": 105, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embeddings", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0]], "output_layers": [["softmax", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}